app/Controllers/AdminController.php

SELECT `form_data`.`id`, `form_data`.`nama_lengkap`, `form_data`.`nama_keluarga`, `form_data`.`np`, `form_data`.`umur`, `form_data`.`jenjang_jabatan`, `rs_list`.`Nama_RS` AS `nama_rs`, `rs_list`.`Jalan` AS `jalan_rs`, `form_data`.`status`
FROM `form_data`
LEFT JOIN `rs_list` ON `form_data`.`rs_id` = `rs_list`.`ID`
WHERE `form_data`.`status` IN ('Terverifikasi','Disetujui','Tertandatangan')
ORDER BY `form_data`.`created_at` DESC
---
    public function index()
    {
        $role = session()->get('role');
        // 1) Ambil data form_data + join sekali ke rs_list
        $builder = $this->formModel
            ->select(
                'form_data.id, '
                    . 'form_data.nama_lengkap, '
                    . 'form_data.nama_keluarga, '
                    . 'form_data.np, '
                    . 'form_data.umur, '
                    . 'form_data.jenjang_jabatan, '
                    . 'rs_list.Nama_RS AS nama_rs, '
                    . 'rs_list.Jalan AS jalan_rs, '
                    . 'form_data.status'
            )
            ->join('rs_list', 'form_data.rs_id = rs_list.ID', 'left')
            ->orderBy('form_data.created_at', 'DESC');
        if ($role === 'admin') {
            // admin lihat Menunggu, Disetujui, Ditolak
            $builder->whereIn('form_data.status', ['Menunggu', 'Disetujui', 'Ditolak', 'Tertandatangan']);
        } else if ($role === 'ruler') {
            // ruler hanya lihat Terverifikasi & Disetujui
            $builder->whereIn('form_data.status', ['Terverifikasi', 'Disetujui', 'Tertandatangan', 'Ditolak']);
        } else {
            // misal user biasa, dialihkan
            return redirect()->to('/')->with('error', 'Akses ditolak.');