app/Controllers/AdminController.php

SELECT `form_data`.`id`, `form_data`.`nama_lengkap`, `form_data`.`nama_keluarga`, `form_data`.`np`, `form_data`.`umur`, `form_data`.`jenjang_jabatan`, `rs_list`.`Nama_RS` AS `nama_rs`, `rs_list`.`Jalan` AS `jalan_rs`, `form_data`.`status`
FROM `form_data`
LEFT JOIN `rs_list` ON `form_data`.`rs_id` = `rs_list`.`ID`
WHERE `form_data`.`status` IN ('Menunggu','Disetujui','Ditolak')
ORDER BY `form_data`.`created_at` DESC
---
    public function index()
    {
        // 1) Ambil data form_data + join sekali ke rs_list
        $data['list_info'] = $this->formModel
            ->select(
                'form_data.id, '
                    . 'form_data.nama_lengkap, '
                    . 'form_data.nama_keluarga, '
                    . 'form_data.np, '
                    . 'form_data.umur, '
                    . 'form_data.jenjang_jabatan, '
                    . 'rs_list.Nama_RS AS nama_rs, '
                    . 'rs_list.Jalan AS jalan_rs, '
                    . 'form_data.status'
            )
            ->join('rs_list', 'form_data.rs_id = rs_list.ID', 'left')
            ->orderBy('form_data.created_at', 'DESC')
            ->findAll();

SELECT `form_data`.*, `rs_list`.`Nama_RS` AS `nama_rs`, `rs_list`.`Jalan` AS `jalan_rs`
FROM `form_data`
LEFT JOIN `rs_list` ON `form_data`.`rs_id` = `rs_list`.`ID`
WHERE `form_data`.`id` = 25
 LIMIT 1
---
    private function fetchWithRs(int $id): array
    {
        $info = $this->formModel
            ->select('form_data.*, rs_list.Nama_RS AS nama_rs, rs_list.Jalan AS jalan_rs')
            ->join('rs_list', 'form_data.rs_id = rs_list.ID', 'left')
            ->where('form_data.id', $id)
            ->first();