app/Controllers/FormController.php

SELECT *
FROM `rs_list`
---
    public function SIPSP(): string
    {
        // Ambil semua record RS dari database
        $rsModel = new RSModel();
        $data['rs_list'] = $rsModel->findAll();