app/Controllers/LoginController.php

    public function login()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'thoriqul29@gmail.com'
 LIMIT 1