app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0
ORDER BY `created_at` DESC
---
    public function getUnreadByUser(int $userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0
---
    public function countUnread(int $userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();